/* Title for OK button in open panel used for adding new search paths to a target */
"Add" = "追加";

/* Title for open panel used for adding new search paths to a target */
"Add Search Paths" = "検索パスを追加";

/* Substring that will become part of the target build setting notice to represent any active build style (used when there's no currently active build style) */
"any active build style" = "任意のアクティブビルドスタイル";

/* Title for OK button in open panel used for choosing the install path. */
"Choose" = "選択";

/* Title for open panel for choosing install location. */
"Choose Install Path" = "インストールパスを選択";

/* Name of current system item in 'Target software runs on' popup. */
"Current System" = "現在のシステム";

/* Name of current system item in 'Target is built with' popup. */
"Current System's" = "現在のシステム";

/* Human-readable label for FRAMEWORKS_SEARCH_PATHS key */
"Frameworks" = "フレームワーク";

/* Label of the 'GCC Compiler Settings' target module */
"GCC Compiler Settings" = "GCC コンパイラ設定";

/* Label of the 'General Settings' target module */
"General Settings" = "一般設定";

/* Human-readable label for HEADER_SEARCH_PATHS key */
"Headers" = "ヘッダ";

/* Label of target settings module 'Installation Location' */
"Installation Location" = "インストール先";

/* Label of the 'Java Archive Settings' target module */
"Java Archive Settings" = "Java アーカイブ設定";

/* Human-readable label for JAVA_CLASS_SEARCH_PATHS key */
"Java Classes" = "Java クラス";

/* Label of the 'Java Compiler Settings' target module */
"Java Compiler Settings" = "Java コンパイラ設定";

/* Human-readable label for LIBRARY_SEARCH_PATHS key */
"Libraries" = "ライブラリ";

/* Label of the 'Ld Linker Settings' target module */
"Linker Settings" = "リンカ設定";

/* Description of -O2 optimizations */
"Most optimizations not requiring a space-time trade-off (same as Simple optimizations, plus common subexpression elimination, strength reduction, and iteration variable elimination)." = "ほとんどの最適化では、メモリ消費量が多くなったり処理時間が長くなることはありません（単純な最適化に加えて、共通部分式の削除、強度の削減、および反復変数の削除が含まれます）。";

/* Description of -O0 optimizations */
"No optimization.  This produces the most debuggable code, but should not be used for shipping code." = "最適化されません。このため、最大限のデバッグ可能コードが生成されますが、出荷用のコードには使用しないでください。";

/* Description of -O3 optimizations */
"Optimization for code size as opposed to speed.  This is the recommended option for shipping code, because the reduced code size often also results in speed gains due to better VM use." = "処理速度ではなくコードサイズの最適化です。これは出荷用のコードに推奨されるオプションです。コードサイズを削減することで、VM をより適切に使用できるようになるため結果的に処理速度が向上することがあります。";

/* Description of -O3 optimizations */
"Optimization for speed as opposed to code size.  May add aggressive function inlining, which is why it should be used with care." = "コードサイズではなく処理速度の最適化です。関数の強力なインライン化が追加される場合があるため、このオプションの使用には注意が必要です。";

/* Label of the 'Search Paths' target module */
"Search Paths" = "検索パス";

/* Description of -O optimizations */
"Simple optimizations, such as automatic register allocation, jump threading, and deferred argument pops." = "自動的なレジスタ割り当て、ジャンプスレッディング、遅延引数ポップなどの単純な最適化です。";

/* Substring that will become part of the target build setting notice to represent the active build style; arg 1 is the name of the active build style */
"the active build style, '%@'" = "アクティブビルドスタイル“%@”";

/* Notice shown in target editor about the fact that the build settings in the target can be overridden; arg 1 is the localized string representing either the active build style or the notion of any build style, arg 2 is the name of current active target */
"The build settings in this editor show what is defined for this target.  When building from within Xcode, some of these settings are currently being overridden by settings defined in %@ (these settings are shown crossed-out).  When building for installation (using 'pbxbuild install -target %@' in a Terminal window), the in this editor will be used." = "このエディタのビルド設定は、このターゲットに対して定義されている内容を示しています。Xcode の内部からビルドするとき、これらの設定の一部が“%@”で定義されている設定によって上書きされることがあります（これらの設定には横線が引かれます）。インストールのためにビルドするときは（“ターミナル”ウインドウで“pbxbuild install -target %@”を使用する場合）、このエディタの設定が使用されます。";

